package ru.psu.techjava.rating.services

import org.springframework.http.ResponseEntity
import ru.psu.techjava.rating.model.CStudent
import java.util.*
/********************************************************************************************************
 * Интерфейс сервиса с бизнес-логикой для работы со списком студентов.                                  *
 * @author Селетков И.П. 2022 1107.                                                                     *
 *******************************************************************************************************/
interface IServiceStudents {
    /****************************************************************************************************
     * Список всех студентов.                                                                           *
     ***************************************************************************************************/
    fun getAll(
    )                                       : Iterable<CStudent>
    /****************************************************************************************************
     * Поиск студента по идентификатору.                                                                *
     * @param id - идентификатор студента для поиска в формате UUID.                                    *
     ***************************************************************************************************/
    fun getById(
        id                                  : UUID
    )                                       : ResponseEntity<CStudent>
    /****************************************************************************************************
     * Создание/изменение студента.                                                                     *
     * @param student - данные студента.                                                                *
     ***************************************************************************************************/
    fun save(
        student                             : CStudent
    )
    /****************************************************************************************************
     * Удаление студента.                                                                               *
     * @param student - данные студента.                                                                *
     ***************************************************************************************************/
    fun delete(
        student                             : CStudent
    )
    /****************************************************************************************************
     * Удаление студента по идентификатору.                                                             *
     * @param id - идентификатор студента для удаления.                                                 *
     ***************************************************************************************************/
    fun deleteById(
        id                                  : UUID
    )                                       : String
}